In [1]:
import pandas as pd
import numpy as np
import disco_functions as ft

# Diclosure control warm up excercises for apprentices

Based on the learning hub course Awarness of Atatistical Disclosure Control with content taken directly from it. 

A few notes before we get started so you dont have to keep switching betwen the course and here. 

**The General Data Protection Regulation [GDPR]** mandates protection for personal data from which the identities of individuals can be determined from the data itself and other sources held by the data controller.  It refers to "special categories" of data, for which additional care must be taken.  These include:

* ethnic origin
* political affiliation
* religion
* biometrics (for ID purposes)
* health
* sexual orientation

An intruder can be:  

* an acquaintance using information gained by **knowing the respondent**, or
* a stranger using information in the **public domain**.

## The Three Major Data Formats

Disclosure control can be applied to any of the following data structures:

* microdata
* frequency tables
* magnitude tables

Statistical information is often held in the form of microdata after collection. In microdata each row corresponds to a single respondent: a business, individual or other statistical unit.

Because microdata are often highly disclosive, they are generally aggregated into frequency tables or magnitude tables before release.

The remainder of the course will outline the risks that each of these data formats pose, and the associated disclosure methods that can be used to reduce the risk to an acceptable level.

##### In this notebook we will only cover microdata

### Protecting Microdata

There are a number of techniques used to protect microdata. The primary method is restricting access under certain license agreements, which will be covered later. Others include:

* Removing identifiers
* Perturbation (such as adding noise)
* Recoding
* Top Coding

#### Excercise 1.1 remove the identifiers from the excercise 1 dataset 

Difficulty: Easy

In [2]:
ex1 = pd.read_csv('data/ex01.csv', index_col = 0) # plz don't chnage this cell!!

In [3]:
ex1

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [4]:
# ex1_1 = ex1 # change this cell to include your solution

# ex1_1=ex1_1.drop(columns=['Name', 'National Insurance Number'])

In [5]:
def function_name(input):
    # stuff
    return None

#changed this to markdown as have imported functions
def remove_identifiers(df_in):
    df_out = df_in.copy()
    df_out = df_in.drop(columns=['Name', 'National Insurance Number'])
    return df_out

In [6]:
ex1_1 = ft.remove_identifiers(ex1)

In [7]:
ex1_1

   Age     Sex Marital Status  Income (£)
1   50    Male        Married     50000.0
2   16  Female        Widowed     18000.0
3   24  Female         Single     24000.0
4   80  Female        Widowed         NaN

#### Excercise 1.2 perturb the dataset acording to how unique the combination of values might be e.g. widows under 25 

Difficulty: Hard

In [8]:
ex1_2 = ex1.copy()
widowed_un25 = ex1[(ex1['Age']<=25) & (ex1['Marital Status']=='Widowed')]
print(widowed_un25)
ex1_2.loc[widowed_un25.index, 'Age'] = 25
ex1_2

                 Name National Insurance Number  Age     Sex Marital Status  \
2  Natalie Pennington                 NY473823T   16  Female        Widowed

   Income (£)
2     18000.0

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,25,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [9]:
ex1

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

#changed this to markdown as have imported functions
def change_age(df_in):
    df_out = df_in.copy()
    widowed_un25a = df_out[(df_out['Age']<=25) & (df_out['Marital Status']=='Widowed')]
    df_out.loc[widowed_un25a.index, 'Age'] = 25
    return df_out

In [10]:
ex1_2_a = ft.change_age(ex1)

In [11]:
ex1_2_a

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,25,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [12]:
ex1.dtypes

Name                          object
National Insurance Number     object
Age                            int64
Sex                           object
Marital Status                object
Income (£)                   float64
dtype: object

#### Excercise 1.3 recode the dataset to change the marital status column 

Difficulty: Medium  

Hint: use a dictionary & map

In [13]:
ex1

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [14]:
ex1_3 = ex1 

marital_dict = {'Married':True, 'Single':False, 'Widowed':False}

ex1_3 ['Is Married' ] = ex1_3 ['Marital Status'].map(marital_dict)

In [15]:
ex1_3=ex1_3.drop(columns=['Name', 'National Insurance Number', 'Marital Status'])

In [16]:
ex1_3

   Age     Sex  Income (£)  Is Married
1   50    Male     50000.0        True
2   16  Female     18000.0       False
3   24  Female     24000.0       False
4   80  Female         NaN       False

In [17]:
ex1

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£),Is Married
1,John Smith,IE524614Z,50,Male,Married,50000.0,True
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0,False
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0,False
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN,False

#changed this to markdown as have imported functions
def new_marital(df_in):
    df_out = df_in.copy()
    marital_dict = {'Married':True, 'Single':False, 'Widowed':False}
    df_out['Is Married'] = df_out['Marital Status'].map(marital_dict) 
    return df_out.drop(columns=['Marital Status'])

In [18]:
ex1_3_a = ft.new_marital(ex1)

In [19]:
ex1_3_a

,Name,National Insurance Number,Age,Sex,Income (£),Is Married
1,John Smith,IE524614Z,50,Male,50000.0,True
2,Natalie Pennington,NY473823T,16,Female,18000.0,False
3,Sarah Cooper,WJ935996X,24,Female,24000.0,False
4,Rosa Pipwell,WV162384O,80,Female,NaN,False

#### Excercise 1.4 top or bottom coding

Difficulty: hmm... it kind of has levels
    
hint: Whats the rule for implimenting a change? whats the change that is implimented?

In [20]:
ex1 = pd.read_csv('data/ex01.csv', index_col = 0) # plz don't chnage this cell!!
ex1_4 = ex1.copy() # change this cell to include your solution

In [21]:
ex1_4 = ex1.copy()
un25 = ex1[(ex1['Age']<=25)]
ex1_4.loc[un25.index, 'Age'] = '<=25'

C:\Users\phills1\AppData\Local\Temp\ipykernel_20664\3416197425.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '<=25' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  ex1_4.loc[un25.index, 'Age'] = '<=25'

1.4 step 1: try making a dataframe containing people who's age is less than 25. step 2: implement a "change" in the dataframe where the condition from step 1 is true step 3. the "change" you need to perform you can use a dictionary

In [22]:
ex1_4

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,<=25,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,<=25,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [23]:
ex1

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,16,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,24,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

#changed this to markdown as have imported functions
def new_age(df_in):
    df_out = df_in.copy()
    under25 = df_out[(df_out['Age']<=25)]
    df_out.loc[under25.index, 'Age'] = '<=25'
    return df_out

In [25]:
ex1_4_a = ft.new_age(ex1)

C:\Users\phills1\scripts\awareness_disco_excercises\disco_functions.py:27: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '<=25' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df_out.loc[under25.index, 'Age'] = '<=25'

In [26]:
ex1_4_a

,Name,National Insurance Number,Age,Sex,Marital Status,Income (£)
1,John Smith,IE524614Z,50,Male,Married,50000.0
2,Natalie Pennington,NY473823T,<=25,Female,Widowed,18000.0
3,Sarah Cooper,WJ935996X,<=25,Female,Single,24000.0
4,Rosa Pipwell,WV162384O,80,Female,Widowed,NaN

In [29]:
ex1_4_a.dtypes

Name                          object
National Insurance Number     object
Age                           object
Sex                           object
Marital Status                object
Income (£)                   float64
dtype: object